Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
  if(AppNavigation::current()==STATE_TIMER_ALARM && TimerFeature::shouldAlarmBeep(now)){
    AudioService::beep(200);
  }
  if(AppNavigation::current()==STATE_TIMER_ALARM && TimerFeature::alarmTimedOut(now)){
    enqueueTimerEvent(EVENT_TIMER_ALARM_TIMEOUT);
  }

  TimerService::update(now);
}

void runReminderCheckTask(FrameContext &context){
  (void)context;
  checkReminders();
}

void runReminderAlarmTask(FrameContext &context){
  updateReminderAlarm(context.nowMs);
}

void runInputTask(FrameContext &context){
  (void)context;
  EventType inputEvent=InputService::readEvent();
  if(inputEvent!=EVENT_NONE){
    int8_t direction = 0;
    if(inputEvent==EVENT_ROTATE_CW) direction = 1;
    else if(inputEvent==EVENT_ROTATE_CCW) direction = -1;
    enqueueEncoderEvent(inputEvent, direction);
  }
}

void runEventTask(FrameContext &context){
  if(processEvents(context.nowMs)){
    runLightingTask(context);
  }
}

void runUiTask(FrameContext &context){
  const unsigned long now = context.nowMs;
  DeviceSettings &settings = SettingsFlow::settings();

  if(now-systemContext.ui.lastRefreshMs>250 || AppNavigation::hasStateChanged()){
    if(AppNavigation::hasStateChanged()){
      HardwareRequests::clearDisplay();
      AppNavigation::clearStateChanged();
    }
    updateBlinkState(now);

    switch(AppNavigation::current()){
      case STATE_CLOCK:
        ClockFeature::update(now,settings.quotes,settings.format24);
        UiScreens::renderClockScreen(ClockFeature::timeRow(),ClockFeature::quoteRow());
        break;

      case STATE_TIMER_VIEW:
      case STATE_TIMER_EDIT:
      case STATE_TIMER_ALARM:
        UiScreens::renderTimerScreen(AppNavigation::current(),timerScreenData(now),systemContext.ui.blinkState);
        break;

      case STATE_STOPWATCH:
        StopwatchFeature::update(now);
        UiScreens::renderStopwatchScreen(stopwatchScreenData());
        break;

      case STATE_REMINDER_HOME:
      case STATE_REMINDER_LIST:
      case STATE_REMINDER_EDIT:
        UiScreens::renderRemindersScreen(AppNavigation::current(),remindersScreenData(),settings.format24,systemContext.ui.blinkState);
        break;

      case STATE_SETTINGS_HOME:
      case STATE_SETTINGS_MENU:
      case STATE_SETTINGS_EDIT:
        UiScreens::renderSettingsScreen(AppNavigation::current(),settings,SettingsFlow::snapshot(FIRMWARE_VERSION,systemContext.ui.blinkState));
        break;

      case STATE_REMINDER_ALARM:
        UiScreens::renderReminderAlarmScreen(remindersScreenData());
        break;
    }

    flushUiFrame();
    systemContext.ui.lastRefreshMs=now;
  }
}

void runDiagnosticsTask(FrameContext &context){
  const SchedulerStats &schedulerStats = scheduler.stats();
  const HardwareRequestStats &hardwareStats = HardwareRequests::stats();
  const EventQueueStats &eventStats = eventQueueStats();
  const FaultSnapshot &faults = FaultTracker::snapshot();
  const FaultRecord &lastFault = faults.lastFault;
  const Esp8266LinkDiagnostics &link = Esp8266Link::diagnostics();
  const UartMonitorStats &uart = UartTrafficMonitor::stats();

  LOG_INFO(
    LogTag::APP,
    "sched loops=%lu tasks=%lu events q=%lu d=%lu drop=%u max=%u seq=%u hw q=%lu x=%lu drop=%u max=%u seq=%u age=%lums",
    (unsigned long)schedulerStats.loopCount,
    (unsigned long)schedulerStats.taskRunCount,
    (unsigned long)eventStats.queued,
    (unsigned long)eventStats.dequeued,
    eventStats.dropped,
    eventStats.maxDepth,
    eventStats.lastSequenceId,
    (unsigned long)hardwareStats.queued,
    (unsigned long)hardwareStats.executed,
    hardwareStats.dropped,
    hardwareStats.maxDepth,
    hardwareStats.lastSequenceId,
    (unsigned long)hardwareStats.maxCommandAgeMs
  );

  LOG_INFO(
    LogTag::APP,
    "OVERRUN count=%lu task=%s runtime=%luus budget=%luus excess=%luus at=%lums maxLoopActual=%luus",
    (unsigned long)schedulerStats.overrunCount,
    schedulerStats.lastOverrunTaskName != nullptr ? schedulerStats.lastOverrunTaskName : "none",
    (unsigned long)schedulerStats.lastOverrunRuntimeUs,
    (unsigned long)schedulerStats.lastOverrunBudgetUs,
    (unsigned long)schedulerStats.lastOverrunExcessUs,
    (unsigned long)schedulerStats.lastOverrunTimestampMs,
    (unsigned long)schedulerStats.maxLoopRuntimeUs
  );

  const LcdDriver::TimingStats &lcdTiming = LcdDriver::timingStats();
  LOG_INFO(
    LogTag::APP,
    "LCD_TIMING clear=%luus row1=%luus row2=%luus frame=%luus setCursor=%luus print=%luus write=%luus maxFrame=%luus ops clear=%lu frame=%lu cursor=%u print=%u write=%u chars=%u rows=%u skipped=%u runs=%u/%u",
    (unsigned long)lcdTiming.clearUs,
    (unsigned long)lcdTiming.row1Us,
    (unsigned long)lcdTiming.row2Us,
    (unsigned long)lcdTiming.frameUs,
    (unsigned long)lcdTiming.setCursorUs,
    (unsigned long)lcdTiming.printUs,
    (unsigned long)lcdTiming.writeUs,
    (unsigned long)lcdTiming.maxFrameUs,
    (unsigned long)lcdTiming.clearCount,
    (unsigned long)lcdTiming.frameUpdateCount,
    (unsigned)lcdTiming.lastFrameSetCursorOps,
    (unsigned)lcdTiming.lastFramePrintOps,
    (unsigned)lcdTiming.lastFrameWriteOps,
    (unsigned)lcdTiming.lastFrameChangedChars,
    (unsigned)lcdTiming.lastFrameRowsChanged,
    (unsigned)lcdTiming.lastFrameRowsSkipped,
    (unsigned)lcdTiming.lastRow1Runs,
    (unsigned)lcdTiming.lastRow2Runs
  );

  LOG_INFO(
    LogTag::APP,
    "LED_STATE desired=%s/%u/%u/%u sent=%s/%u/%u/%u pending=%s/%u/%u/%u status=%s retry=%u ackAge=%lums err=%s",
    link.desiredLedMode,
    link.desiredLedPower ? 1 : 0,
    link.desiredLedBrightness,
    link.desiredLedSpeed,
    link.lastSentLedMode,
    link.lastSentLedPower ? 1 : 0,
    link.lastSentLedBrightness,
    link.lastSentLedSpeed,
    link.pendingLedMode,
    link.pendingLedPower ? 1 : 0,
    link.pendingLedBrightness,
    link.pendingLedSpeed,
    Esp8266Link::ledStatusName(link.ledStatus),
    link.ledRetryCount,
    link.lastLedAckMs == 0 ? 0UL : (unsigned long)(context.nowMs - link.lastLedAckMs),
    link.lastLedErrReason
  );

